<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for kopia.
            This downloads the latest version of the kopia cli for macOS.
        </string>
        <key>Identifier</key>
        <string>com.github.kyle-humane.download.kopia</string>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>asset_regex</key>
                    <string>kopia\-\d+\.\d+\.\d+\-macOS\-universal\.tar\.gz</string>
                    <key>github_repo</key>
                    <string>kopia/kopia</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>kopia-%version%.tar.gz</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
             <dict>
                <key>Arguments</key>
                <dict>
                    <key>archive_format</key>
                    <string>tar_gzip</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads</string>
                </dict>
                <key>Processor</key>
                <string>Unarchiver</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>